// виведення парних чисел за допомогою циклів

// for (let index = 0; index < 10; index++) {
//     if (index % 2 == 0 && index != 0) {
//         console.log(index) 
//     }
// }




// таблиця множення для числа 5 

// let a = 1;

// while (a < 11){
//     console.log(a*5)
//     a++
// }





// Числа від 1 до 10

// for (let index = 1; index < 11; index++) {
//         console.log(index)  
// }




//факторіал числа 6

// let result = 1
// let count = 7 

// for (let index = 1; index < count; index++) {
//     result = result*index
// }

// console.log(result) 





// рядок з 5 *

// let star = ""

// for (let index = 0; index < 5; index++) {
//     star += "*"
//     console.log(star)
    
// }




// сума чисел в діапазоні 

// let a = 2
// let b = 10 
// let result = 0

// for (let index = a; index < b+1; index++) {
//     result = result + index
    
// }

// console.log(result) 





// сума чисел в діапазоні prompt

// let a = Number(prompt(`Введіть 1 число діапазону`))
// let b = Number(prompt(`Введіть 2 число діапазону`)) 
// let result = 0

// for (let index = a; index < b+1; index++) {
//      result = result + index
    
// }

// console.log(result) 














                                                                    // Домашнє завдання.



                                                                    // Мінімальний рівень.

// 1. Напишіть програму, яка виводить на консоль числа від 1 до 5 за допомогою циклу for.

// 2. Створіть програму, яка обчислює суму перших 10 натуральних чисел і виводить результат.

// 3. Напишіть програму, яка виводить парні числа від 2 до 10 включно за допомогою циклу for.




                                                                    // Середній рівень.

// 1. Створіть програму, яка визначає факторіал числа, яке користувач вводить (наприклад, факторіал числа 5 - це 5! = 5 * 4 * 3 * 2 * 1).

// 2. Напишіть програму, яка генерує та виводить на консоль перші 10 чисел Фібоначчі (послідовність, в якій кожне наступне число є сумою двох попередніх: 0, 1, 1, 2, 3, 5, 8, тощо).

// 3. Розробіть програму, яка знаходить всі прості числа в заданому діапазоні і виводить їх.





                                                                    // Високий рівень.

// 1. Напишіть програму, яка перевіряє, чи є введене число паліндромом (наприклад, 121 або 1331).

// 2. Створіть програму, яка обчислює суму всіх простих чисел в заданому діапазоні.

// 3. Розробіть "гру вгадай число", де програма обирає випадкове число від 1 до 100, а користувач повинен вгадати його. Програма надає підказки про те, чи число більше чи менше введеного користувачем.










                                                                    // Мінімальний рівень.


// 1

//  for (let index = 1; index < 6; index++) {
//      console.log(index);
    
//  }



//2

//  let sum = 0;
//  for (let index = 1; index <= 10; index++) {
//      sum += index;
//  }

//  console.log(sum);


//3

//  for (let index = 0; index < 11; index++) {
//           if (index % 2 == 0 && index != 0) {
//              console.log(index) 
//           }
//       }


                                                                    // Середній рівень.

//1 

//  let result = 1
//  let count = Number(prompt(`Введіть факторіал якого числа ви бажаєте знайти:`)) 

//  for (let index = 1; index < count+1; index++) {
//      result = result*index
//  }

//  console.log(result) 


 //2

 let a = 0
 let b = 1;
 console.log(a)  
 console.log(b)  

 for (let index = 2; index < 10; index++) {
    let next = a + b
    console.log(next)
    a = b
    b = next  
    
 }

 
 //3




                                                                    // Високий рівень.


//1 


  
 




