


// alert('Hello world')

// console.log('Hello world')

                              //зміні

// let a = 1
// console.log(a)

// a = 2
// console.log(a)


// let a = 'Hy world'

//pes Patron

// let pesPatron

//////////////////

// let age
// age = prompt('Введіть свій вік')

// alert(age)


               ///№1

// let name = 'andrii'
// let surname = 'smolinskyi'
// console.log(name, surname)

// //////Д/з

// let pr
// pr = prompt('Теперішній президент України ?')
// alert(pr)

// let president = 'Володимир'
// console.log(president)


               ///№2

// let name = 'Іван'
// let admin = name
// console.log(name) 



///типи даних

//числовий 

                                //Зошит

// let message;

// message = 'Привіт';

// alert(message);

                                                                // Домашка



//                                                             Мінімальний рівень

// 1. Зробити віднімання string "7" і числа 2. Відповідь має вийти матетично вірною.

// 2. Використовуючи операції додавання, віднімання, множення і ділення, обчисліть результат виразу: (10 + 5) * 2 - 7 / 3. Виведіть результат.

// 3. Створіть змінну "name" і присвойте їй ваше ім'я. Виведіть рядок, який містить ваше ім'я та каже "Привіт, [ім'я]!".

//                                                             Середній рівень.

// 1. Створіть змінну "hours" і присвойте їй кількість годин у вашому робочому дні. Створіть змінну "rate" і присвойте їй ставку оплати за годину. Розрахуйте вашу заробітну плату за день та виведіть її.

// 2. Користувач вводить в промпт ціну свого продукту і потрібно вирахувати який в ній пдв.

// 3. Конвектор валют. Користувач вводить для прикладу 500 і йому покаже скільки це в доларах.

//                                                             Високий рівень

// 1. Користувач вводить радіус кола і повинно вивестисть його діаметр, довжину та площу.

// 2. Депозит. Користувач вводить якусь кількість грошей під 4% річних. Скільки він отримає за два роки.




//                                                             Мінімальний рівень

1.

let str = "7";
let num = 2;

let result = str - num;

console.log(result);

2.

alert(`Результат: ${(10 + 5) * 2 - 7 / 3}`)

3.

let name = 'Назарій';
alert(`Привіт ${name} !`);

                                                                // Середній рівень

1.

let hours = 5;
let rate = 25;

let zp = hours * rate;

alert(`Ваша зарплата: ${zp} доларів`);