


// alert('Hello world')

// console.log('Hello world')

                              //зміні

// let a = 1
// console.log(a)

// a = 2
// console.log(a)


// let a = 'Hy world'

//pes Patron

// let pesPatron

//////////////////

// let age
// age = prompt('Введіть свій вік')

// alert(age)


               ///№1

// let name = 'andrii'
// let surname = 'smolinskyi'
// console.log(name, surname)

// //////Д/з

// let pr
// pr = prompt('Теперішній президент України ?')
// alert(pr)

// let president = 'Володимир'
// console.log(president)


               ///№2

// let name = 'Іван'
// let admin = name
// console.log(name) 



///типи даних

//числовий 

                                //Зошит

// let message;

// message = 'Привіт';

// alert(message);










                                                                // Домашка



//                                                             Мінімальний рівень

// 1. Зробити віднімання string "7" і числа 2. Відповідь має вийти матетично вірною.

// 2. Використовуючи операції додавання, віднімання, множення і ділення, обчисліть результат виразу: (10 + 5) * 2 - 7 / 3. Виведіть результат.

// 3. Створіть змінну "name" і присвойте їй ваше ім'я. Виведіть рядок, який містить ваше ім'я та каже "Привіт, [ім'я]!".

//                                                             Середній рівень.

// 1. Створіть змінну "hours" і присвойте їй кількість годин у вашому робочому дні. Створіть змінну "rate" і присвойте їй ставку оплати за годину. Розрахуйте вашу заробітну плату за день та виведіть її.

// 2. Користувач вводить в промпт ціну свого продукту і потрібно вирахувати який в ній пдв.

// 3. Конвектор валют. Користувач вводить для прикладу 500 і йому покаже скільки це в доларах.

//                                                             Високий рівень

// 1. Користувач вводить радіус кола і повинно вивестисть його діаметр, довжину та площу.

// 2. Депозит. Користувач вводить якусь кількість грошей під 4% річних. Скільки він отримає за два роки.




//                                                             Мінімальний рівень

1.

let str = "7";
let num = 2;

let result = str - num;

console.log(result.toFixed(2));

2.

alert(`Результат: ${(10 + 5) * 2 - 7 / 3 .toFixed(2)}`)

3.

let name = 'Назарій';
alert(`Привіт ${name} !`);


                                                                // Середній рівень

1.

let hours = 5;
let rate = 25;

let zp = hours * rate;

alert(`Ваша зарплата: ${zp} доларів`);

2.

let price = prompt('Введіть ціну свого товару (грн)')

let percent = 0.20;

let pdv = price * percent;

alert(`ПДВ складає: ${pdv.toFixed(2)} грн`)

3.

let grn = prompt(`Введіть ціну яку вихочите внести до обміника в гривнях`)

let dolar = 40.09

let obmen = grn / dolar;

alert(`Свої ${grn} грн, ви зможете обміняти на ${obmen.toFixed(2)} доларів`)


//                                                             Високий рівень

1.

let radius = prompt(`Введіть радіус кола в сантиметрах`)

let diametr = radius * 2;

let dovsina = 2 * 3.14 * radius;

let ploshca = 3.14 * radius; 

alert(`Якщо радіус кола = ${radius} см, то діаметр кола = ${diametr} см, довжина кола = ${dovsina} см , а площа кола = ${ploshca} см²`)